In [1]:
import pandas as pd

In [2]:
Orders=pd.read_csv('NewOrder.csv')
UsersOrders=pd.read_csv('orders.csv')
Products=pd.read_csv('products.csv')

In [3]:
NewDataset=pd.merge(Orders,UsersOrders,on=['order_id','order_id'])

In [5]:
NewDataset=NewDataset[['product_id','user_id']]
NewDataset.head()

   product_id  user_id
0       33120   202279
1       28985   202279
2        9327   202279
3       45918   202279
4       30035   202279

In [6]:
NewDataset=pd.merge(NewDataset,Products,on=['product_id','product_id'])

In [7]:
NewDataset.head()

   product_id  user_id        product_name  aisle_id  department_id
0       33120   202279  Organic Egg Whites        86             16
1       33120   153404  Organic Egg Whites        86             16
2       33120    23750  Organic Egg Whites        86             16
3       33120    58707  Organic Egg Whites        86             16
4       33120   166654  Organic Egg Whites        86             16

In [8]:
NewDataset=NewDataset[['product_id','user_id','aisle_id','department_id']]

In [9]:
NewDataset.head()

   product_id  user_id  aisle_id  department_id
0       33120   202279        86             16
1       33120   153404        86             16
2       33120    23750        86             16
3       33120    58707        86             16
4       33120   166654        86             16

In [11]:
NewDataset.to_csv('UserProducts.csv',index=False)